<a href="https://colab.research.google.com/github/Touheda812/Python/blob/main/Data_Analysis_Kaggle_Sales_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd

In [12]:
data = pd.read_csv ('/sales.csv')

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0,3,4,5,6,10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

## Check Top 10 Rows of the Dataset

In [14]:
data.head(10)

   Id        EmployeeName  ...         Agency Status
0   1      NATHANIEL FORD  ...  San Francisco    NaN
1   2        GARY JIMENEZ  ...  San Francisco    NaN
2   3      ALBERT PARDINI  ...  San Francisco    NaN
3   4   CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5     PATRICK GARDNER  ...  San Francisco    NaN
5   6      DAVID SULLIVAN  ...  San Francisco    NaN
6   7           ALSON LEE  ...  San Francisco    NaN
7   8       DAVID KUSHNER  ...  San Francisco    NaN
8   9      MICHAEL MORRIS  ...  San Francisco    NaN
9  10  JOANNE HAYES-WHITE  ...  San Francisco    NaN

[10 rows x 13 columns]

## Check Last 10 Rows of the Dataset

In [16]:
data.tail(10)

            Id      EmployeeName  ...         Agency Status
153586  148645      Randy D Winn  ...  San Francisco     PT
153587  148646  Carolyn A Wilson  ...  San Francisco     PT
153588  148647      Not provided  ...  San Francisco    NaN
153589  148648    Joann Anderson  ...  San Francisco     PT
153590  148649       Leon Walker  ...  San Francisco     PT
153591  148650     Roy I Tillery  ...  San Francisco     PT
153592  148651      Not provided  ...  San Francisco    NaN
153593  148652      Not provided  ...  San Francisco    NaN
153594  148653      Not provided  ...  San Francisco    NaN
153595  148654         Joe Lopez  ...  San Francisco     PT

[10 rows x 13 columns]

## Number of rows and columns

In [17]:
data.shape

(153596, 13)

In [19]:
print("Number of Rows:",data.shape[0])
print("Number of Columns:",data.shape[1])

Number of Rows: 153596
Number of Columns: 13

## Informatins about the dataset

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153596 entries, 0 to 153595
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                153596 non-null  object
 1   EmployeeName      153596 non-null  object
 2   JobTitle          153596 non-null  object
 3   BasePay           152991 non-null  object
 4   OvertimePay       153596 non-null  object
 5   OtherPay          153595 non-null  object
 6   Benefits          117438 non-null  object
 7   TotalPay          153596 non-null  float64
 8   TotalPayBenefits  153596 non-null  float64
 9   Year              153595 non-null  float64
 10  Notes             1 non-null       object
 11  Agency            153595 non-null  object
 12  Status            43057 non-null   object
dtypes: float64(3), object(10)
memory usage: 15.2+ MB

## Check how many NULL values r there in the dataset

In [24]:
data.isnull()

           Id  EmployeeName  JobTitle  BasePay  ...   Year  Notes  Agency  Status
0       False         False     False    False  ...  False   True   False    True
1       False         False     False    False  ...  False   True   False    True
2       False         False     False    False  ...  False   True   False    True
3       False         False     False    False  ...  False   True   False    True
4       False         False     False    False  ...  False   True   False    True
...       ...           ...       ...      ...  ...    ...    ...     ...     ...
153591  False         False     False    False  ...  False   True   False   False
153592  False         False     False    False  ...  False   True   False    True
153593  False         False     False    False  ...  False   True   False    True
153594  False         False     False    False  ...  False   True   False    True
153595  False         False     False    False  ...  False   True   False   False

[153596 rows x 13 columns]

In [23]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 1
Benefits             36158
TotalPay                 0
TotalPayBenefits         0
Year                     1
Notes               153595
Agency                   1
Status              110539
dtype: int64

## DROP extra columns

In [25]:
data.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [28]:
data = data.drop(['Id','Notes','Agency','Status'],axis=1)

In [30]:
data

             EmployeeName  ...    Year
0          NATHANIEL FORD  ...  2011.0
1            GARY JIMENEZ  ...  2011.0
2          ALBERT PARDINI  ...  2011.0
3       CHRISTOPHER CHONG  ...  2011.0
4         PATRICK GARDNER  ...  2011.0
...                   ...  ...     ...
153591      Roy I Tillery  ...  2014.0
153592       Not provided  ...  2014.0
153593       Not provided  ...  2014.0
153594       Not provided  ...  2014.0
153595          Joe Lopez  ...  2014.0

[153596 rows x 9 columns]

In [33]:
data.head(1)

     EmployeeName  ...    Year
0  NATHANIEL FORD  ...  2011.0

[1 rows x 9 columns]

## Get Overall statistics about the dataframe

In [34]:
data.describe()

            TotalPay  TotalPayBenefits           Year
count  153596.000000     153596.000000  153595.000000
mean    72498.496882      90827.677255    2012.570188
std     51236.145049      63744.278001       1.129896
min      -618.130000       -618.130000    2011.000000
25%     28815.220000      35271.320000    2012.000000
50%     69563.345000      90245.015000    2013.000000
75%    104255.847500     131241.155000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [35]:
data.describe(include='all')

       EmployeeName          JobTitle  ... TotalPayBenefits           Year
count        153596            153596  ...    153596.000000  153595.000000
unique       110812              2160  ...              NaN            NaN
top       Kevin Lee  Transit Operator  ...              NaN            NaN
freq             13              7273  ...              NaN            NaN
mean            NaN               NaN  ...     90827.677255    2012.570188
std             NaN               NaN  ...     63744.278001       1.129896
min             NaN               NaN  ...      -618.130000    2011.000000
25%             NaN               NaN  ...     35271.320000    2012.000000
50%             NaN               NaN  ...     90245.015000    2013.000000
75%             NaN               NaN  ...    131241.155000    2014.000000
max             NaN               NaN  ...    567595.430000    2014.000000

[11 rows x 9 columns]

## TOP 5 Employees Names

In [36]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [38]:
data['EmployeeName'].value_counts().head()

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Victor Lee      10
Name: EmployeeName, dtype: int64

## Number of UNIQUE Job Title

In [39]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [42]:
data['JobTitle'].nunique()

2160

## ToTal Job Titles that contains captain

In [43]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [44]:
data['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
153591                                         Custodian
153592                                      Not provided
153593                                      Not provided
153594                                      Not provided
153595                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 153596, dtype: object

In [51]:
data[data['JobTitle'].str.contains('CAPTAIN')]

              EmployeeName  ...    Year
1             GARY JIMENEZ  ...  2011.0
2           ALBERT PARDINI  ...  2011.0
11        PATRICIA JACKSON  ...  2011.0
17          SEBASTIAN WONG  ...  2011.0
22           GEORGE GARCIA  ...  2011.0
...                    ...  ...     ...
121546   Gregory L Stewart  ...  2014.0
125809     Michael J Moran  ...  2014.0
127303  Michael V Rolovich  ...  2014.0
131530    Stephen M Tittel  ...  2014.0
137174     Jeanne M Seyler  ...  2014.0

[552 rows x 9 columns]

## GET THE number of captain  // Case=false is no case sensative

In [52]:
len(data[data['JobTitle'].str.contains('CAPTAIN',case=False)])

552

In [55]:
data[data['JobTitle'].str.contains('CAPTAIN',case=False)].count()

EmployeeName        552
JobTitle            552
BasePay             551
OvertimePay         552
OtherPay            552
Benefits            411
TotalPay            552
TotalPayBenefits    552
Year                552
dtype: int64